In [47]:
import numpy as np
import pandas as pd
from numpy import *

In [48]:
datadict={"Name":["Edison","Edward","James","Neesham"],"Age":[28,27,NaN,36]}

In [49]:
data=pd.DataFrame.from_dict(datadict)

In [50]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [51]:
data.dropna()

      Name   Age
0   Edison  28.0
1   Edward  27.0
3  Neesham  36.0

In [52]:
data.fillna(data.mean())

C:\Users\Mihir\AppData\Local\Temp\ipykernel_15888\3231489778.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.fillna(data.mean())

      Name        Age
0   Edison  28.000000
1   Edward  27.000000
2    James  30.333333
3  Neesham  36.000000

In [53]:
data.fillna(data["Age"].mode()[0])

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James  27.0
3  Neesham  36.0